#### Terraform Initialization `success`
#### Terraform Plan `success`
#### Pusher: kouxi08, Action: `pull_request`

<details><summary>Show Plan</summary>

```text
terraform
data.sakuracloud_archive.ubuntu_archive: Reading...
sakuracloud_switch.k8s_internal_switch: Refreshing state... [id=113601666699]
sakuracloud_disk.k8s_rook_disk[5]: Refreshing state... [id=113601666727]
sakuracloud_ssh_key_gen.gen_key: Refreshing state... [id=113601666701]
sakuracloud_disk.k8s_rook_disk[1]: Refreshing state... [id=113601666717]
sakuracloud_disk.k8s_rook_disk[4]: Refreshing state... [id=113601666710]
sakuracloud_disk.k8s_rook_disk[0]: Refreshing state... [id=113601666714]
sakuracloud_disk.k8s_rook_disk[3]: Refreshing state... [id=113601666718]
sakuracloud_internet.k8s_external_switch: Refreshing state... [id=113601666700]
sakuracloud_disk.k8s_rook_disk[6]: Refreshing state... [id=113601666721]
data.sakuracloud_archive.ubuntu_archive: Read complete after 1s [id=113600510456]
sakuracloud_disk.k8s_rook_disk[7]: Refreshing state... [id=113601666723]
sakuracloud_disk.k8s_rook_disk[2]: Refreshing state... [id=113601666722]
sakuracloud_disk.k8s_control_plane_disk[0]: Refreshing state... [id=113601666711]
sakuracloud_disk.k8s_control_plane_disk[2]: Refreshing state... [id=113601666730]
sakuracloud_disk.k8s_router_disk[0]: Refreshing state... [id=113601666728]
sakuracloud_disk.k8s_worker_node_disk[4]: Refreshing state... [id=113601666709]
sakuracloud_disk.k8s_worker_node_disk[6]: Refreshing state... [id=113601666707]
sakuracloud_disk.k8s_worker_node_disk[2]: Refreshing state... [id=113601666702]
sakuracloud_disk.k8s_worker_node_disk[1]: Refreshing state... [id=113601666708]
sakuracloud_disk.k8s_worker_node_disk[0]: Refreshing state... [id=113601666704]
sakuracloud_disk.k8s_worker_node_disk[3]: Refreshing state... [id=113601666705]
sakuracloud_disk.k8s_worker_node_disk[7]: Refreshing state... [id=113601666703]
sakuracloud_disk.k8s_worker_node_disk[5]: Refreshing state... [id=113601666726]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # sakuracloud_disk.k8s_control_plane_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113601666711" -> (known after apply)
        name                 = "k8s-dev-control-plane-1"
      ~ server_id            = "113601666767" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_control_plane_disk[1] will be created
  + resource "sakuracloud_disk" "k8s_control_plane_disk" {
      + connector            = "virtio"
      + encryption_algorithm = "none"
      + id                   = (known after apply)
      + name                 = "k8s-dev-control-plane-2"
      + plan                 = "ssd"
      + server_id            = (known after apply)
      + size                 = 20
      + source_archive_id    = "113600510456"
      + tags                 = [
          + "dev",
          + "k8s",
        ]
      + zone                 = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s_control_plane_disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113601666730" -> (known after apply)
        name                 = "k8s-dev-control-plane-3"
      + server_id            = (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_router_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_router_disk" {
      ~ id                   = "113601666728" -> (known after apply)
        name                 = "k8s-dev-router-1"
      ~ server_id            = "113601666760" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601666704" -> (known after apply)
        name                 = "k8s-dev-worker-node-1"
      ~ server_id            = "113601666743" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601666708" -> (known after apply)
        name                 = "k8s-dev-worker-node-2"
      ~ server_id            = "113601666742" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601666702" -> (known after apply)
        name                 = "k8s-dev-worker-node-3"
      ~ server_id            = "113601666745" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[3] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601666705" -> (known after apply)
        name                 = "k8s-dev-worker-node-4"
      ~ server_id            = "113601666737" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[4] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601666709" -> (known after apply)
        name                 = "k8s-dev-worker-node-5"
      ~ server_id            = "113601666744" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[5] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601666726" -> (known after apply)
        name                 = "k8s-dev-worker-node-6"
      ~ server_id            = "113601666756" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[6] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601666707" -> (known after apply)
        name                 = "k8s-dev-worker-node-7"
      ~ server_id            = "113601666736" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[7] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601666703" -> (known after apply)
        name                 = "k8s-dev-worker-node-8"
      ~ server_id            = "113601666741" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_server.k8s_control_plane[0] will be created
  + resource "sakuracloud_server" "k8s_control_plane" {
      + commitment        = "standard"
      + core              = 2
      + cpu_model         = (known after apply)
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 4
      + name              = "k8s-dev-control-plane-1"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = "163.43.210.1"
          + hostname        = "k8s-dev-control-plane-1"
          + ip_address      = "163.43.210.5"
          + netmask         = 27
          + password        = (sensitive value)
          + ssh_key_ids     = [
              + "113601666701",
            ]
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113601666706"
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113601666699"
          + user_ip_address = "192.168.100.10"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_control_plane[1] will be created
  + resource "sakuracloud_server" "k8s_control_plane" {
      + commitment        = "standard"
      + core              = 2
      + cpu_model         = (known after apply)
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 4
      + name              = "k8s-dev-control-plane-2"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = "163.43.210.1"
          + hostname        = "k8s-dev-control-plane-2"
          + ip_address      = "163.43.210.6"
          + netmask         = 27
          + password        = (sensitive value)
          + ssh_key_ids     = [
              + "113601666701",
            ]
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113601666706"
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113601666699"
          + user_ip_address = "192.168.100.11"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_control_plane[2] will be created
  + resource "sakuracloud_server" "k8s_control_plane" {
      + commitment        = "standard"
      + core              = 2
      + cpu_model         = (known after apply)
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 4
      + name              = "k8s-dev-control-plane-3"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = "163.43.210.1"
          + hostname        = "k8s-dev-control-plane-3"
          + ip_address      = "163.43.210.7"
          + netmask         = 27
          + password        = (sensitive value)
          + ssh_key_ids     = [
              + "113601666701",
            ]
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113601666706"
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113601666699"
          + user_ip_address = "192.168.100.12"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_router[0] will be created
  + resource "sakuracloud_server" "k8s_router" {
      + commitment        = "standard"
      + core              = 1
      + cpu_model         = (known after apply)
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 1
      + name              = "k8s-dev-router-1"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = "163.43.210.1"
          + hostname        = "k8s-dev-router-1"
          + ip_address      = "163.43.210.4"
          + netmask         = 27
          + password        = (sensitive value)
          + ssh_key_ids     = [
              + "113601666701",
            ]
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113601666706"
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113601666699"
          + user_ip_address = "192.168.100.0"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_worker_node[0] will be created
  + resource "sakuracloud_server" "k8s_worker_node" {
      + commitment        = "standard"
      + core              = 2
      + cpu_model         = (known after apply)
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 4
      + name              = "k8s-dev-worker-node-1"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = "163.43.210.1"
          + hostname        = "k8s-dev-worker-node-1"
          + ip_address      = "163.43.210.8"
          + netmask         = 27
          + password        = (sensitive value)
          + ssh_key_ids     = [
              + "113601666701",
            ]
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113601666706"
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113601666699"
          + user_ip_address = "192.168.100.20"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_worker_node[1] will be created
  + resource "sakuracloud_server" "k8s_worker_node" {
      + commitment        = "standard"
      + core              = 2
      + cpu_model         = (known after apply)
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 4
      + name              = "k8s-dev-worker-node-2"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = "163.43.210.1"
          + hostname        = "k8s-dev-worker-node-2"
          + ip_address      = "163.43.210.9"
          + netmask         = 27
          + password        = (sensitive value)
          + ssh_key_ids     = [
              + "113601666701",
            ]
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113601666706"
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113601666699"
          + user_ip_address = "192.168.100.21"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_worker_node[2] will be created
  + resource "sakuracloud_server" "k8s_worker_node" {
      + commitment        = "standard"
      + core              = 2
      + cpu_model         = (known after apply)
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 4
      + name              = "k8s-dev-worker-node-3"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = "163.43.210.1"
          + hostname        = "k8s-dev-worker-node-3"
          + ip_address      = "163.43.210.10"
          + netmask         = 27
          + password        = (sensitive value)
          + ssh_key_ids     = [
              + "113601666701",
            ]
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113601666706"
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113601666699"
          + user_ip_address = "192.168.100.22"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_worker_node[3] will be created
  + resource "sakuracloud_server" "k8s_worker_node" {
      + commitment        = "standard"
      + core              = 2
      + cpu_model         = (known after apply)
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 4
      + name              = "k8s-dev-worker-node-4"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = "163.43.210.1"
          + hostname        = "k8s-dev-worker-node-4"
          + ip_address      = "163.43.210.11"
          + netmask         = 27
          + password        = (sensitive value)
          + ssh_key_ids     = [
              + "113601666701",
            ]
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113601666706"
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113601666699"
          + user_ip_address = "192.168.100.23"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_worker_node[4] will be created
  + resource "sakuracloud_server" "k8s_worker_node" {
      + commitment        = "standard"
      + core              = 2
      + cpu_model         = (known after apply)
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 4
      + name              = "k8s-dev-worker-node-5"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = "163.43.210.1"
          + hostname        = "k8s-dev-worker-node-5"
          + ip_address      = "163.43.210.12"
          + netmask         = 27
          + password        = (sensitive value)
          + ssh_key_ids     = [
              + "113601666701",
            ]
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113601666706"
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113601666699"
          + user_ip_address = "192.168.100.24"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_worker_node[5] will be created
  + resource "sakuracloud_server" "k8s_worker_node" {
      + commitment        = "standard"
      + core              = 2
      + cpu_model         = (known after apply)
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 4
      + name              = "k8s-dev-worker-node-6"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = "163.43.210.1"
          + hostname        = "k8s-dev-worker-node-6"
          + ip_address      = "163.43.210.13"
          + netmask         = 27
          + password        = (sensitive value)
          + ssh_key_ids     = [
              + "113601666701",
            ]
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113601666706"
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113601666699"
          + user_ip_address = "192.168.100.25"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_worker_node[6] will be created
  + resource "sakuracloud_server" "k8s_worker_node" {
      + commitment        = "standard"
      + core              = 2
      + cpu_model         = (known after apply)
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 4
      + name              = "k8s-dev-worker-node-7"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = "163.43.210.1"
          + hostname        = "k8s-dev-worker-node-7"
          + ip_address      = "163.43.210.14"
          + netmask         = 27
          + password        = (sensitive value)
          + ssh_key_ids     = [
              + "113601666701",
            ]
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113601666706"
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113601666699"
          + user_ip_address = "192.168.100.26"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_worker_node[7] will be created
  + resource "sakuracloud_server" "k8s_worker_node" {
      + commitment        = "standard"
      + core              = 2
      + cpu_model         = (known after apply)
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 4
      + name              = "k8s-dev-worker-node-8"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = "163.43.210.1"
          + hostname        = "k8s-dev-worker-node-8"
          + ip_address      = "163.43.210.15"
          + netmask         = 27
          + password        = (sensitive value)
          + ssh_key_ids     = [
              + "113601666701",
            ]
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113601666706"
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113601666699"
          + user_ip_address = "192.168.100.27"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_subnet.bgp_subnet will be created
  + resource "sakuracloud_subnet" "bgp_subnet" {
      + id              = (known after apply)
      + internet_id     = "113601666700"
      + ip_addresses    = (known after apply)
      + max_ip_address  = (known after apply)
      + min_ip_address  = (known after apply)
      + netmask         = 28
      + network_address = (known after apply)
      + next_hop        = (known after apply)
      + switch_id       = (known after apply)
      + zone            = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

Plan: 25 to add, 0 to change, 11 to destroy.

Changes to Outputs:
  + external_address_range       = (known after apply)
  + k8s_control_plane_ip_address = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + k8s_router_ip_address        = [
      + (known after apply),
    ]
  + k8s_worker_node_ip_address   = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>